app/controllers/actions_controller.rb

  def show
    @action = Action.find(params[:id])
---
SELECT "actions".* FROM "actions" WHERE "actions"."id" = $1 LIMIT 1  [["id", "1"]]

  def edit
    @action = Action.find(params[:id])
---
SELECT "actions".* FROM "actions" WHERE "actions"."id" = $1 LIMIT 1  [["id", "3"]]

  def create

    if params[:project_id]
      project = Project.find(params[:project_id])
      @action = current_user.actions.build(params[:act])
      @action.project_id = project.id

      respond_to do |format|
        if @action.save
---
INSERT INTO "actions" ("area_id", "assigned_to", "created_at", "description", "project_id", "scheduled_for", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def destroy
    @action = Action.find(params[:id])
    @action.destroy
---
SELECT "actions".* FROM "actions" WHERE "actions"."id" = $1 LIMIT 1  [["id", "8"]]
DELETE FROM "actions" WHERE "actions"."id" = $1  [["id", 8]]