app/controllers/pages_controller.rb

  def overview
    @stuff = Stuff.all
---
SELECT "stuff".* FROM "stuff"