app/controllers/stuff_controller.rb

  def show
    @stuff = Stuff.find(params[:id])
---
SELECT "stuff".* FROM "stuff" WHERE "stuff"."id" = $1 LIMIT 1  [["id", "1"]]

  def edit
    @stuff = Stuff.find(params[:id])
---
SELECT "stuff".* FROM "stuff" WHERE "stuff"."id" = $1 LIMIT 1  [["id", "30"]]

  def create
    @stuff = current_user.stuff.build(params[:stuff])

    respond_to do |format|
      if @stuff.save
---
INSERT INTO "stuff" ("created_at", "description", "name", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Sun, 17 Mar 2013 10:09:43 UTC +00:00], ["description", "Make basic functionality"], ["name", "Osspey"], ["updated_at", Sun, 17 Mar 2013 10:09:43 UTC +00:00], ["user_id", nil]]

  def update
    @stuff = Stuff.find(params[:id])

    respond_to do |format|
      if @stuff.update_attributes(params[:stuff])
        if params[:commit] == "Save"
          format.html { redirect_to @stuff, notice: 'Stuff was successfully updated.' }
          format.json { head :no_content }
        elsif params[:commit] == "To Project"
          format.html { redirect_to @stuff, notice: 'Stuff was successfully updated.' }
          format.json { head :no_content }
        elsif params[:commit] == "Next Action"
          action = @stuff.make_action current_user
          @stuff.destroy
---
SELECT "stuff".* FROM "stuff" WHERE "stuff"."id" = $1 LIMIT 1  [["id", "62"]]
UPDATE "stuff" SET "description" = 'Call Mom', "updated_at" = '2013-03-20 22:59:55.663986' WHERE "stuff"."id" = 62
DELETE FROM "stuff" WHERE "stuff"."id" = $1  [["id", 62]]

  def destroy
    @stuff = Stuff.find(params[:id])
    @stuff.destroy
---
SELECT "stuff".* FROM "stuff" WHERE "stuff"."id" = $1 LIMIT 1  [["id", "48"]]
DELETE FROM "stuff" WHERE "stuff"."id" = $1  [["id", 48]]