app/controllers/stuff_controller.rb

  def index
    @stuff = Stuff.all
---
SELECT "stuff".* FROM "stuff"